{
  "project": "SDK Documentation",
  "branchName": "flow/sdk-docs",
  "description": "Integrated SDK docs. Copy content from nextmavens-js/README.md. Installation guide. Client initialization. Database, auth, realtime, storage examples. Error handling guide.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Copy SDK README",
      "description": "As a documentation reader, I want SDK documentation integrated so that I don't have to leave the docs site.",
      "acceptanceCriteria": [
        "Copy content from nextmavens-js/README.md",
        "Format for docs site",
        "Organize into sections",
        "Add to docs navigation",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Created SDK documentation page at /docs/sdk with installation commands (npm, yarn, pnpm), code examples for database, auth, realtime, storage, and GraphQL. Added to docs navigation. Typecheck passed."
    },
    {
      "id": "US-002",
      "title": "Document Installation",
      "description": "As a developer, I want installation instructions so that I can add the SDK to my project.",
      "acceptanceCriteria": [
        "Installation section created",
        "Shows npm install command",
        "Shows yarn install command",
        "Shows pnpm install command",
        "Copy buttons on each command",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Installation section already implemented in src/app/docs/sdk/page.tsx with npm, yarn, and pnpm commands, each with copy buttons. Typecheck passed."
    },
    {
      "id": "US-003",
      "title": "Document Client Initialization",
      "description": "As a developer, I want client initialization documented so that I can set up the SDK.",
      "acceptanceCriteria": [
        "Initialization section created",
        "Shows code examples",
        "Explains API key configuration",
        "Shows environment options",
        "Copy buttons",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added Client Configuration section to SDK docs with initialization code examples, API key configuration (required options: apiKey, projectId), optional options (apiUrl, timeout), environment variables guide (.env file), and different environments example (development vs production). Each code example includes copy buttons. Typecheck passes."
    },
    {
      "id": "US-004",
      "title": "Document Database Usage",
      "description": "As a developer, I want database usage documented so that I can query data.",
      "acceptanceCriteria": [
        "Database section created",
        "Query examples: select, insert, update, delete",
        "Filter examples",
        "Join examples",
        "Code examples with syntax highlighting",
        "Copy buttons",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added comprehensive Database section to SDK docs with 7 detailed examples covering: Select Data (with pagination and ordering), Insert Data (single and multiple records), Update Data (single and multiple records), Delete Data (with conditions), Filter Operators (eq, neq, gt, gte, lt, lte, like, ilike, contains, in), Combining Filters (AND/OR logic), and Joins and Relations (foreign key relationships). All examples have syntax highlighting, copy buttons, and detailed comments. Added Key Concepts section with best practices. Typecheck passes."
    },
    {
      "id": "US-005",
      "title": "Document Auth Methods",
      "description": "As a developer, I want auth methods documented so that I can implement authentication.",
      "acceptanceCriteria": [
        "Auth section created",
        "Examples: signUp, signIn, signOut",
        "Session management",
        "User retrieval",
        "Code examples with syntax highlighting",
        "Copy buttons",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added comprehensive Auth section to SDK docs (src/app/docs/sdk/page.tsx) with 8 detailed examples: Sign Up (basic and with metadata), Sign In (basic with session persistence), Get Current User, Sign Out (basic and global), Session Management (auth state listeners, refresh session, check validity), Update User Profile, Reset Password (request and update), and Error Handling (common auth errors). Each example includes code with syntax highlighting and copy buttons. Added best practices section with security tips. Typecheck passes."
    },
    {
      "id": "US-006",
      "title": "Document Realtime Subscriptions",
      "description": "As a developer, I want realtime subscriptions documented so that I can use WebSocket features.",
      "acceptanceCriteria": [
        "Realtime section created",
        "Subscribe examples",
        "Unsubscribe examples",
        "Channel examples",
        "Filter examples",
        "Code examples with syntax highlighting",
        "Copy buttons",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added comprehensive Realtime section to SDK docs with 8 detailed examples covering: Subscribe to All Changes (INSERT, UPDATE, DELETE), Subscribe to Specific Events (event-specific channels), Filter Subscriptions (with eq filters), Multiple Subscriptions (multiple tables on one channel), Channel with Presence Tracking (online users, custom state), Broadcast Messages (client-to-client communication), Unsubscribe and Cleanup (proper lifecycle management with React useEffect), Error Handling and Reconnection (connection state monitoring). Each example includes code with syntax highlighting and copy buttons. Added best practices section with tips for production use. Typecheck passes."
    },
    {
      "id": "US-007",
      "title": "Document Storage Operations",
      "description": "As a developer, I want storage operations documented so that I can upload and download files.",
      "acceptanceCriteria": [
        "Storage section created",
        "Upload example",
        "Download example",
        "List files example",
        "Delete file example",
        "Code examples with syntax highlighting",
        "Copy buttons",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added comprehensive Storage section to SDK docs with detailed examples covering: File Upload (with options like cacheControl and upsert), Get Public URL (for sharing files), List Files (with pagination and sorting), Download File (creating blob URLs for download), Delete File (single or multiple files). Each example includes code with syntax highlighting and copy buttons. Added best practices section with tips for file naming, cache control, validation, and organization. Typecheck passes."
    },
    {
      "id": "US-008",
      "title": "Document Error Handling",
      "description": "As a developer, I want error handling documented so that I can handle failures gracefully.",
      "acceptanceCriteria": [
        "Error handling section created",
        "Try/catch examples",
        "Error code explanations",
        "Retry logic examples",
        "Best practices",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 2,
      "passes": true,
      "notes": "Completed: Added comprehensive Error Handling section to SDK documentation page (src/app/docs/sdk/page.tsx) with 8 detailed examples covering: Basic Try/Catch Pattern with error checking, Error Object Structure (message, code, details, hint), Common Error Codes handling (23505, 23503, 23502, PGRST116, 22P02), Network Error Handling with retry logic, Retry Logic with Exponential Backoff (generic retry wrapper), Error Boundaries for React (class component and hook patterns), Validation Errors with type-safe input validation, Error Logging and Monitoring utility. Added error code reference table with 6 common codes. Added best practices section with 10 key points. All examples include syntax highlighting and copy buttons. Typecheck passes."
    },
    {
      "id": "US-009",
      "title": "Add TypeScript Examples",
      "description": "As a TypeScript developer, I want TypeScript examples so that I have type-safe code.",
      "acceptanceCriteria": [
        "TypeScript examples alongside JavaScript",
        "Type definitions shown",
        "Generic usage examples",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 2,
      "passes": true,
      "notes": "Completed: Added comprehensive TypeScript section to SDK documentation page (src/app/docs/sdk/page.tsx) with 5 detailed examples covering: Type Definitions (User, Post, DatabaseResponse, SingleResponse interfaces), Generic Query Functions (fetchOne, fetchMany with full generics), Type-Safe Insert (createUser, createPosts with Omit<> utility types), Type-Safe Updates (updateUser with Partial<> and conditional updates), Typed Join Queries (OrderWithItems, fetchWithRelation generics), React Hook with TypeScript (useQuery and useMutation custom hooks). All examples show proper TypeScript patterns: interfaces for table schemas, generic functions, utility types (Omit, Pick, Partial), proper error handling with typed errors. Added TypeScript best practices section with 7 key points. Each example has syntax highlighting and copy buttons. Typecheck passes."
    },
    {
      "id": "US-010",
      "title": "Link to SDK Repo",
      "description": "As a developer, I want links to the SDK repo so that I can report issues and contribute.",
      "acceptanceCriteria": [
        "Link to GitHub repo in each section",
        "\"Report an issue\" link",
        "\"View source\" link",
        "\"Contributing\" link",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 2,
      "passes": true,
      "notes": "Completed: Added SDK repo links to each section (Installation, Client Configuration, Database, Authentication, Realtime, Storage, Error Handling, TypeScript). Each section now has a footer with three links: 'View Source' (GitHub repo), 'Report Issue' (GitHub issues), and 'Contributing' (CONTRIBUTING.md). Links use Lucide icons (Github, FileText, Download) with proper hover effects and open in new tabs with rel='noopener noreferrer'. Typecheck passes."
    }
  ],
  "relatedPRDs": [],
  "consolidatedMemory": "",
  "lessonsLearned": "",
  "memorialFile": "docs/memory/SDK Documentation.md"
}