{
  "project": "Platform Philosophy",
  "branchName": "flow/platform-philosophy",
  "description": "Opinionated stance document. Postgres-native approach. Realtime is DB-driven. Storage abstraction strategy. JWT-first authentication. Multi-tenant by default. Attracts the right developers.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Document Postgres-Native Approach",
      "description": "As a documentation reader, I want the platform's Postgres-first philosophy documented so that I understand the technical foundation.",
      "acceptanceCriteria": [
        "Postgres-native section created",
        "Explains: SQL-first, not ORM-first",
        "Explains: direct database access",
        "Explains: benefits (portability, power, familiarity)",
        "Examples showing Postgres features",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5
      ],
      "mcpTools": {
        "step5": []
      },
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Document Realtime DB-Driven Philosophy",
      "description": "",
      "acceptanceCriteria": [
        "Realtime philosophy section created",
        "Explains: subscriptions follow table structure",
        "Explains: CDC-based, not custom protocol",
        "Explains: benefits (schema-driven, automatic)",
        "Comparison to alternatives",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5
      ],
      "mcpTools": {
        "step5": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added Realtime DB-Driven Philosophy section to platform-philosophy page. Includes three main benefits: Subscriptions Follow Table Structure (subscribe to any table, filters use SQL WHERE, schema-driven), CDC-Based Not Custom Protocol (Postgres logical replication, INSERT/UPDATE/DELETE capture, ordered delivery), and Schema-Driven and Automatic (automatic sync with schema, no separate config). Added comparison table showing NextMavens DB-Driven vs Custom Pub/Sub approaches. Added 'Why DB-Driven Realtime Wins' section explaining Single Source of Truth, Automatic Schema Evolution, and Built-in Reliability. Cross-link to /docs/realtime documentation. Updated 'comingSoon' flag to false for Realtime DB-Driven principle. Typecheck passes."
    },
    {
      "id": "US-003",
      "title": "Document Storage Abstraction Strategy",
      "description": "",
      "acceptanceCriteria": [
        "Storage philosophy section created",
        "Explains: Telegram for raw, Cloudinary for optimized",
        "Explains: transparent abstraction",
        "Explains: benefits (cost, performance, simplicity)",
        "Shows when to use which",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5
      ],
      "mcpTools": {
        "step5": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added Storage Abstraction Strategy section to platform-philosophy page. Includes four main benefits: Transparent Dual-Provider Strategy (automatic backend selection, Telegram for original/raw files, Cloudinary for optimized/web-ready assets, unified API), Cost Optimization (Telegram free storage up to 2GB/file, Cloudinary CDN delivery + optimization, automatic compression and format conversion), Performance Through CDN (global edge caching, automatic format selection WebP/AVIF, responsive image generation, video streaming optimization), and Developer Simplicity (single SDK for all storage operations, automatic URL generation, built-in transformation support, no manual provider management). Added 'When to Use Which Provider' section comparing Telegram for raw file storage and long-term archiving vs Cloudinary for optimized web assets and media delivery. Added feature comparison table showing storage cost, max file size, CDN delivery, image optimization, and transformations. Added 'How It Works' step-by-step section explaining the unified API flow. Cross-link to /docs/storage documentation. Updated 'comingSoon' flag to false for Storage Abstraction principle. Typecheck passes."
    },
    {
      "id": "US-004",
      "title": "Document JWT-First Authentication",
      "description": "",
      "acceptanceCriteria": [
        "Auth philosophy section created",
        "Explains: JWT-first, not sessions",
        "Explains: stateless benefits",
        "Explains: token-based auth flow",
        "Comparison to session-based auth",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5
      ],
      "mcpTools": {
        "step5": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added JWT-First Authentication section to platform-philosophy page. Includes four main benefits: Stateless Architecture (no session storage, scales horizontally, reduced infrastructure complexity), Token-Based Auth Flow (single token with claims, Authorization header, no cookie/CSRF concerns, works across domains), Horizontal Scalability (any server validates JWT, no sticky sessions, serverless-friendly, simple auto-scaling), and Cross-Service Compatibility (one token for web/mobile/API, microservices share validation, standard OAuth 2.0/OpenID Connect). Added JWT vs Session comparison table covering Server State, Scalability, Performance, Revocation, Token Size, and Cross-Domain aspects. Added step-by-step Token-Based Authentication Flow with code examples showing authentication, JWT reception, request inclusion, and validation. Added 'Why JWT-First Wins' section explaining Horizontal Scaling, Simpler Infrastructure, Microservices Ready, and No CSRF vulnerabilities. Cross-link to /docs/auth documentation. Updated 'comingSoon' flag to false for JWT-First Auth principle. Typecheck passes."
    },
    {
      "id": "US-005",
      "title": "Document Multi-Tenant by Default",
      "description": "",
      "acceptanceCriteria": [
        "Multi-tenant section created",
        "Explains: every project is isolated",
        "Explains: tenant schemas",
        "Explains: isolation enforcement",
        "Benefits: security, scalability",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5
      ],
      "mcpTools": {
        "step5": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added Multi-Tenant by Default section to platform-philosophy page. Includes three main benefits: Schema-Based Isolation (each project gets dedicated Postgres schema, tenant_{slug} schema pattern, complete data isolation), Security Through Isolation (no cross-tenant data access, RLS policies per schema, separate database users per tenant), and Scalability (efficient resource utilization, easy tenant onboarding, independent tenant scaling). Added 'How It Works' section explaining the tenant isolation flow. Added comparison showing multi-tenant vs single-tenant approaches. Updated 'comingSoon' flag to false for Multi-Tenant principle. Typecheck passes."
    },
    {
      "id": "US-008",
      "title": "Document Security Principles",
      "description": "",
      "acceptanceCriteria": [
        "Security principles section created",
        "Explains: fail closed, not open",
        "Explains: explicit over implicit",
        "Explains: audit everything",
        "Explains: zero trust by default",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5
      ],
      "mcpTools": {
        "step5": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added Security Principles section to platform-philosophy page. Includes four main principles: Fail Closed Not Open (default deny policies, unknown inputs rejected, validation failures return 403), Explicit Over Implicit (all permissions defined in code, no hidden permissions, security decisions auditable), Audit Everything (all auth events logged, authorization failures logged, audit logs immutable), and Zero Trust by Default (all requests require authentication, internal services authenticate with each other, input validation on all boundaries). Added code examples for fail-closed API endpoints, explicit authorization declaration, comprehensive audit logging, and zero trust network segmentation. Added anti-patterns section covering implicit role-based access, fail-open configuration, hidden admin bypasses, and selective audit logging. Added 'Why Security-First Wins' section explaining prevention over detection, auditable by design, zero trust works everywhere, and operational simplicity. Updated 'comingSoon' flag to false for Security Principles principle. Typecheck passes."
    },
    {
      "id": "US-009",
      "title": "Document Operational Simplicity",
      "description": "",
      "acceptanceCriteria": [
        "Operations section created",
        "Explains: boring technology",
        "Explains: minimal dependencies",
        "Explains: observable by default",
        "Explains: automated operations",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5
      ],
      "mcpTools": {
        "step5": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added Operational Simplicity section to platform-philosophy page. Includes four main principles: Boring Technology (mature, well-understood tools with proven track records: PostgreSQL since 1997, Node.js, React, standard protocols), Minimal Dependencies (fewer vulnerabilities and maintenance burden, prefer built-in modules, regular audits), Observable by Default (metrics, logs, and traces built-in from day one, structured logging with request IDs, Prometheus metrics, distributed tracing, health checks everywhere), and Automated Operations (CI/CD pipelines, automated backups and restoration, auto-scaling, automated security scanning). Added code examples showing structured logging with request IDs, health checks everywhere, automated backups and restoration, and CI/CD pipeline with quality gates. Added 'Boring vs Bleeding Edge' comparison table covering tech stack, dependency count, observability, deployment, on-call experience, and time to debug. Added 'Why Operational Simplicity Wins' section explaining reduced toil, fewer surprises, faster debugging, and scales without heroes. Cross-link to /docs/infrastructure documentation. Updated 'comingSoon' flag to false for Operational Simplicity principle. Typecheck passes."
    },
    {
      "id": "US-010",
      "title": "Add Comparison to Alternatives",
      "description": "",
      "acceptanceCriteria": [
        "Comparison section created",
        "Compares to: Supabase, Firebase, AWS Amplify",
        "Shows: similarities and differences",
        "Shows: when to choose NextMavens",
        "Honest assessment of trade-offs",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5
      ],
      "mcpTools": {
        "step5": []
      },
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Document API-First Design",
      "description": "",
      "acceptanceCriteria": [
        "API-first section created",
        "Explains: CLI, automation, CI/CD first-class",
        "Explains: UI consumes same APIs",
        "Benefits: automation, integration, testing",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5
      ],
      "mcpTools": {
        "step5": []
      },
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Document Developer Experience Principles",
      "description": "",
      "acceptanceCriteria": [
        "DX principles section created",
        "Explains: predictable errors",
        "Explains: comprehensive docs",
        "Explains: tooling (CLI, SDK)",
        "Explains: fast feedback loops",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5
      ],
      "mcpTools": {
        "step5": []
      },
      "priority": 2,
      "passes": false,
      "notes": ""
    }
  ],
  "relatedPRDs": [],
  "consolidatedMemory": "",
  "lessonsLearned": "",
  "memorialFile": "docs/memory/Platform Philosophy.md"
}