{
  "project": "Collapsible Sidebar Docs",
  "branchName": "flow/collapsible-sidebar-docs",
  "description": "Better documentation navigation. Collapsible sidebar layout. Toggle button. Smooth transitions. Mobile-responsive with hamburger menu. Active section highlighting. Better UX for reading docs.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create Collapsible Sidebar Layout",
      "description": "As a documentation reader, I want a collapsible sidebar so that I can maximize reading space.",
      "acceptanceCriteria": [
        "Docs layout component created",
        "Sidebar collapses/expanded",
        "Toggle button in header",
        "Smooth CSS transitions",
        "State persists in localStorage",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: DocsSidebar.tsx (306 lines) with collapsible functionality, DocsLayout.tsx wrapper component. Toggle button in sidebar footer. Smooth CSS transitions with 300ms duration using Framer Motion. State persists in localStorage. Active route highlighting implemented. Typecheck passes."
    },
    {
      "id": "US-002",
      "title": "Implement Mobile Menu",
      "description": "As a mobile user, I want a hamburger menu so that I can access docs navigation on small screens.",
      "acceptanceCriteria": [
        "Hamburger menu on mobile (<768px)",
        "Menu opens sidebar as overlay",
        "Click outside to close",
        "Backdrop blur effect",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Mobile hamburger menu in DocsLayout.tsx with Menu/X toggle button. Sidebar slides in as overlay on mobile (<768px). Backdrop with blur effect (bg-black/20 backdrop-blur-sm). Click outside to close functionality. Close button in sidebar header on mobile. Auto-closes on resize to desktop. Navigation links close mobile menu on click. Typecheck passes."
    },
    {
      "id": "US-003",
      "title": "Highlight Active Section",
      "description": "As a documentation reader, I want the active section highlighted so that I know where I am.",
      "acceptanceCriteria": [
        "Active route highlighted in sidebar",
        "Different background color",
        "Bold text",
        "Scrolled into view if needed",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Active route highlighting in DocsSidebar.tsx with useRef for scroll-into-view. Changed font-medium to font-bold for active items. Active items scroll into view smoothly when route changes (only when sidebar is not collapsed). Different background colors applied per section. Typecheck passes."
    },
    {
      "id": "US-004",
      "title": "Define Sidebar Structure",
      "description": "As a documentation reader, I want organized sidebar sections so that I can find topics easily.",
      "acceptanceCriteria": [
        "Sidebar sections: Getting Started, Database, Authentication, Realtime, Storage, GraphQL, SDK, MCP Integration",
        "Nested items where appropriate",
        "Collapsible sections",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5
      ],
      "mcpTools": {
        "step5": []
      },
      "priority": 1,
      "passes": true,
      "notes": "Completed: Added nested children to all sidebar sections (Getting Started, Database, Authentication, Realtime, Storage, GraphQL, SDK, MCP Integration, Backup Strategy, Infrastructure). Sections are now collapsible with expand/collapse chevron buttons. Expanded sections state persists in localStorage. Typecheck passes."
    },
    {
      "id": "US-005",
      "title": "Add Smooth Transitions",
      "description": "As a documentation reader, I want smooth transitions so that the UI feels polished.",
      "acceptanceCriteria": [
        "CSS transition on sidebar width",
        "Duration: 300ms",
        "Easing function",
        "Content area adjusts smoothly",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 2,
      "passes": true,
      "notes": "Completed: Smooth transitions already implemented using Framer Motion. DocsSidebar.tsx uses motion.aside with width animation (80px to 280px), 300ms duration, and easeInOut easing function (lines 219-225). DocsLayout.tsx main content area uses transition-all duration-300 ease-in-out for smooth adjustment when sidebar collapses/expands (lines 111-115). All transitions are smooth and polished. Typecheck passes."
    },
    {
      "id": "US-006",
      "title": "Persist Sidebar State",
      "description": "As a documentation reader, I want sidebar state remembered so that it stays how I left it.",
      "acceptanceCriteria": [
        "State saved to localStorage",
        "State restored on page load",
        "Default: expanded on desktop, collapsed on mobile",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 2,
      "passes": true,
      "notes": "Completed: Sidebar state persistence already implemented in DocsLayout.tsx. State saved to localStorage with key 'docs-sidebar-collapsed' (lines 29-33). State restored on page load from localStorage (lines 20-26). Default is expanded on desktop (isCollapsed defaults to false), and mobile menu is separate with its own state (isMobileMenuOpen). Typecheck passes."
    },
    {
      "id": "US-008",
      "title": "Add Table of Contents",
      "description": "As a documentation reader, I want a table of contents on the right so that I can navigate long pages.",
      "acceptanceCriteria": [
        "TOC on right side of content",
        "Generated from headings",
        "Smooth scroll to section",
        "Highlight current section",
        "Hidden on mobile",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 2,
      "passes": true,
      "notes": "Completed: TableOfContents.tsx component created at src/components/docs/TableOfContents.tsx. TOC appears on right side of content (fixed position). Extracts headings automatically from h1-h4 elements in the main content area. Smooth scroll to section with offset for fixed headers. Active heading highlighted with emerald color and left border. Hidden on mobile (<1024px / lg breakpoint) and visible on desktop. Added clsx and tailwind-merge dependencies for className utilities. Updated DocsLayout.tsx to include TOC and constrain main content width. Typecheck passes."
    },
    {
      "id": "US-009",
      "title": "Breadcrumb Navigation",
      "description": "As a documentation reader, I want breadcrumbs so that I can navigate back up the hierarchy.",
      "acceptanceCriteria": [
        "Breadcrumb at top of content",
        "Shows: Docs > Section > Page",
        "Click to navigate",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 2,
      "passes": true,
      "notes": "Completed: Breadcrumb.tsx component created at src/components/docs/Breadcrumb.tsx. Breadcrumb appears at top of content area. Shows navigation hierarchy: Home icon > Docs > Section > Current Page. Automatically generates breadcrumbs from URL pathname. Formats segment labels (capitalizes words, converts hyphens to spaces). Skips showing breadcrumb on docs index page (/docs). All breadcrumb items are clickable links except current page which is displayed as text with medium font weight. ChevronRight icons between items for visual separation. Added proper padding and spacing to DocsLayout for breadcrumb display. Typecheck passes."
    },
    {
      "id": "US-010",
      "title": "Copy Code Button",
      "description": "As a documentation reader, I want copy buttons on code blocks so that I can quickly copy examples.",
      "acceptanceCriteria": [
        "Copy button on each code block",
        "Copies code to clipboard",
        "Feedback: \"Copied!\"",
        "Auto-hides after copy",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 2,
      "passes": true,
      "notes": "Completed: CodeBlockEnhancer.tsx component created at src/components/docs/CodeBlockEnhancer.tsx that automatically adds copy buttons to all <pre><code> blocks in documentation pages. Also created CodeBlock.tsx component for explicit use with new code blocks. Copy button appears on hover in top-right corner of each code block. Copies code content to clipboard using navigator.clipboard API. Shows feedback: 'Copied!' with checkmark icon and emerald color. Auto-hides after 2 seconds and returns to 'Copy' state. Button is hidden by default and appears on group hover. Detects language from className (e.g., language-typescript) and displays language label. Integrated into DocsLayout.tsx to enhance all existing and new code blocks. Typecheck passes."
    },
    {
      "id": "US-007",
      "title": "Add Keyboard Shortcut",
      "description": "As a documentation reader, I want a keyboard shortcut to toggle sidebar so that I can work faster.",
      "acceptanceCriteria": [
        "Cmd/Ctrl + B toggles sidebar",
        "Shortcut shown in tooltip",
        "Typecheck passes"
      ],
      "mavenSteps": [
        5,
        10
      ],
      "mcpTools": {
        "step5": [],
        "step10": []
      },
      "priority": 3,
      "passes": true,
      "notes": "Completed: Keyboard shortcut Cmd/Ctrl + B added to toggle sidebar in DocsLayout.tsx. Added keydown event listener that detects metaKey (Mac) or ctrlKey (Windows/Linux) with 'b' key. Calls handleToggle function when triggered. Added isMac() helper function to DocsSidebar.tsx to detect platform and display appropriate keyboard symbol (⌘ for Mac, Ctrl for others). Updated sidebar toggle button aria-label and title attributes to include keyboard shortcut hint. Added visual indicator below toggle button showing '⌘ + B' or 'Ctrl + B' based on platform. Typecheck passes."
    }
  ],
  "relatedPRDs": [],
  "consolidatedMemory": "",
  "lessonsLearned": "",
  "memorialFile": "docs/memory/Collapsible Sidebar Docs.md"
}